NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG24/EFR32BG24A010F1024IM40.svd
        <register>
          <name>DSACTRL</name>
          <description>No Description</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <resetValue>0x000A2090</resetValue>
          <resetMask>0xFFEFFFFF</resetMask>
          <fields>
            <field>
              <name>DSAMODE</name>
              <description>Mode of Digital Signal Arrival detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DSA is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DSA is enabled by the relative/absolute RSSI detector and is reset by using detectors for spike content and frequency deviation. The RSSI jump detector is used to recover from false detects.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARRTHD</name>
              <description>Signal arrival valid counter threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRTOLERTHD0</name>
              <description>Arrival tolerance threshold 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRTOLERTHD1</name>
              <description>Arrival tolerance threshold 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHPRD</name>
              <description>Search period window length </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TS2</name>
                  <description>The search period is 2 symbol periods.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS4</name>
                  <description>The search period is 4 symbol periods.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQAVGSYM</name>
              <description>DSA frequency estimation averaging</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG2TS</name>
                  <description>Frequency estimation over 2 symbol periods.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG4TS</name>
                  <description>Frequency estimation over 4 symbol periods.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRANRSTDSA</name>
              <description>power transient detector Reset DSA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSARSTON</name>
              <description>DSA detection reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAINREDUCDLY</name>
              <description>Detection Delay of AGC gain reduction</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWDUTY</name>
              <description>Low duty cycle delay</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTORE</name>
              <description>Power detector reset of DSA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCBAUDEN</name>
              <description>Consider Baud_en from AGC</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPJUPTHD</name>
              <description>Amplitude jump detection thrshold</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGMIXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <fields>
            <field>
              <name>DIGMIXFREQ</name>
              <description>Digital mixer frequency control word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGMIXMODE</name>
              <description>Digital mixer frequency control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFOSR</name>
                  <description>Mixer frequency specified by CFOSR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGMIXFREQ</name>
                  <description>Mixer frequency specified by DIGMIXFREQ.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIXERCONJ</name>
              <description>Digital mixer input conjugate</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGMIXFB</name>
              <description>Digital mixer Frequency Correction </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VITERBIDEMOD</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00206100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VTDEMODEN</name>
              <description>Viterbi demodulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HARDDECISION</name>
              <description>Hard decision</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI1</name>
              <description>VITERBI KSI1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI2</name>
              <description>VITERBI KSI2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI3</name>
              <description>VITERBI KSI3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTHAFC</name>
              <description>Synthesizer AFC in Viterbi demod</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRCYCLE</name>
              <description>Correction cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRSTPSIZE</name>
              <description>Correction step size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG0</name>
          <description>No Description</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x123556B7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXPECTPATT</name>
              <description>Expected pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG1</name>
          <description>No Description</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x5020C000</resetValue>
          <resetMask>0xF7FDFFFF</resetMask>
          <fields>
            <field>
              <name>VITERBIKSI3WB</name>
              <description>WB KSI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KSI3SWENABLE</name>
              <description>WB KSI3 Switching Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTFRQLIM</name>
              <description>Viterbi frequency limiter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPSYNCLEN</name>
              <description>Expected sync length</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPECTHT</name>
              <description>Expected patterns head and tail</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTTRACK</name>
          <description>No Description</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0D803B88</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FREQTRACKMODE</name>
              <description>Frequency tracking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Frequency tracking disabled. Only a one-time frequency offset compensation applied through DSA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 16 symbol periods.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 32 symbol periods.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 48 symbol periods.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMTRACKTHD</name>
              <description>Timing tracking threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEACQUTHD</name>
              <description>Time acquisition threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMGEAR</name>
              <description>Timing Gear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEAR0</name>
                  <description>Execute timing tracking regardless of difference between Early/Late and Current correlation values. Referred to as fast gear. Same as GEAR3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR1</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 75% or less of the Current correlation value. Referred to as medium gear.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR2</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 50% or less of the Current correlation value. Referred to as slow gear.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQBIAS</name>
              <description>Frequency estimation bias</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPWRTHD</name>
              <description>High Power detection threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTBLETIMING</name>
          <description>No Description</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000FFF7</resetMask>
          <fields>
            <field>
              <name>VTBLETIMINGSEL</name>
              <description>Viterbi BLE timing stamp selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAMEDET_DELAY</name>
                  <description>Delayed frame detection will be used as Timing stamp. This mode should be selected for legacy demod and Long Range BLE demod. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME_PULSE</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a narrow pulse signal and pulse width is one xo clock cycle. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a wdie pulse signal </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_END_FRAME</name>
                  <description>For testing only.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VTBLETIMINGCLKSEL</name>
              <description>Viterbi BLE timing stamp clock select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMINGDELAY</name>
              <description>Viterbi BLE Delay timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLENOFF</name>
              <description>Timing Stamp Frame Length Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISDEMODOF</name>
              <description>Disable VT Demod Over Flow Detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BREST</name>
          <description>No Description</description>
          <addressOffset>0x154</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>BRESTINT</name>
              <description>Integer part of estimated baudrate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BRESTNUM</name>
              <description>Fractional part of estimated baudrate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCG</name>
          <description>No Description</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>AUTOCGEN</name>
              <description>Enable automatic clock gating</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CGCLKSTOP</name>
          <description>No Description</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCEOFF</name>
              <description>Manual control clocks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POE</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>POEI</name>
              <description>In-phase component of POE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POEQ</name>
              <description>Quadrature component of POE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
